# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by first performing data cleaning, formatting, and structuring.

1. Create a new DataFrame that only includes customers who:
   - have a **low total_claim_amount** (e.g., below $1,000),
   - have a response "Yes" to the last marketing campaign.

In [4]:
import numpy as np
import pandas as pd
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv'
df = pd.read_csv(url)  
df.head(3)

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,...,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN
1,1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,...,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A

In [5]:
df.columns

Index(['Unnamed: 0', 'Customer', 'State', 'Customer Lifetime Value',
       'Response', 'Coverage', 'Education', 'Effective To Date',
       'EmploymentStatus', 'Gender', 'Income', 'Location Code',
       'Marital Status', 'Monthly Premium Auto', 'Months Since Last Claim',
       'Months Since Policy Inception', 'Number of Open Complaints',
       'Number of Policies', 'Policy Type', 'Policy', 'Renew Offer Type',
       'Sales Channel', 'Total Claim Amount', 'Vehicle Class', 'Vehicle Size',
       'Vehicle Type'],
      dtype='object')

In [3]:
# 1. Create a new DataFrame that only includes customers who:
# - have a **low total_claim_amount** (e.g., below $1,000),
# - have a response "Yes" to the last marketing campaign.
df2 = df[(df['Total Claim Amount'] < 1000) & (df['Response'] == 'Yes')]
df2.head(3)

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,...,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
8,8,FM55990,California,5989.773931,Yes,Premium,College,1/19/11,Employed,M,...,0.0,1,Personal Auto,Personal L1,Offer2,Branch,739.200000,Sports Car,Medsize,NaN
15,15,CW49887,California,4626.801093,Yes,Basic,Master,1/16/11,Employed,F,...,0.0,1,Special Auto,Special L1,Offer2,Branch,547.200000,SUV,Medsize,NaN

2. Using the original Dataframe, analyze:
   - the average `monthly_premium` and/or customer lifetime value by `policy_type` and `gender` for customers who responded "Yes", and
   - compare these insights to `total_claim_amount` patterns, and discuss which segments appear most profitable or low-risk for the company.

In [7]:
# 2. Using the original Dataframe, analyze:
#   - the average `monthly_premium` and/or customer lifetime value by `policy_type` and `gender` for customers who responded "Yes", and
#   - compare these insights to `total_claim_amount` patterns, and discuss which segments appear most profitable or low-risk for the company.
df_yes = df[df['Response'] == 'Yes']
pivot_analysis = df_yes.pivot_table(index=['Policy Type', 'Gender'], values=['Customer Lifetime Value', 'Monthly Premium Auto', 'Total Claim Amount'], aggfunc='mean')
pivot_analysis

                       Customer Lifetime Value  Monthly Premium Auto  \
Policy Type    Gender
Corporate Auto F                   7712.628736             94.301775
               M                   7944.465414             92.188312
Personal Auto  F                   8339.791842             98.998148
               M                   7448.383281             91.085821
Special Auto   F                   7691.584111             92.314286
               M                   8247.088702             86.343750

                       Total Claim Amount
Policy Type    Gender
Corporate Auto F               433.738499
               M               408.582459
Personal Auto  F               452.965929
               M               457.010178
Special Auto   F               453.280164
               M               429.527942

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

In [8]:
#3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.
df_totalNumber = df.groupby('State').size().reset_index(name='num_customers').sort_values(by='num_customers', ascending=False)

# filter states with more than 500 customers
df_totalNumber_filtered = df_totalNumber[df_totalNumber['num_customers'] > 500]

# display the filtered result
df_totalNumber_filtered

        State  num_customers
1  California           3552
3      Oregon           2909
0     Arizona           1937
2      Nevada            993
4  Washington            888

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

In [9]:
#4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.
df_max = df.pivot_table(index=['Education', 'Gender'], values=['Customer Lifetime Value'], aggfunc='max')
df_max

                             Customer Lifetime Value
Education            Gender
Bachelor             F                   73225.95652
                     M                   67907.27050
College              F                   61850.18803
                     M                   61134.68307
Doctor               F                   44856.11397
                     M                   32677.34284
High School or Below F                   55277.44589
                     M                   83325.38119
Master               F                   51016.06704
                     M                   50568.25912

In [ ]:
df_min = df.pivot_table(index=['Education', 'Gender'], values=['Customer Lifetime Value'], aggfunc='min')
df_min

                             Customer Lifetime Value
Education            Gender
Bachelor             F                   1904.000852
                     M                   1898.007675
College              F                   1898.683686
                     M                   1918.119700
Doctor               F                   2395.570000
                     M                   2267.604038
High School or Below F                   2144.921535
                     M                   1940.981221
Master               F                   2417.777032
                     M                   2272.307310

In [11]:
df_median = df.pivot_table(index=['Education', 'Gender'], values=['Customer Lifetime Value'], aggfunc='median')
df_median

                             Customer Lifetime Value
Education            Gender
Bachelor             F                   5640.505303
                     M                   5548.031892
College              F                   5623.611187
                     M                   6005.847375
Doctor               F                   5332.462694
                     M                   5577.669457
High School or Below F                   6039.553187
                     M                   6286.731006
Master               F                   5729.855012
                     M                   5579.099207

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [ ]:
# your code goes here